# Terraform environment at23
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.rbac.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.postgres_server.data.azurerm_client_config.current: Reading...
data.azurerm_subnet.postgres: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.spoke: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_subnet.default: Reading...
module.key_vault.data.azurerm_client_config.current: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at23/subnets/Postgres]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at23]
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at23/subnets/Default]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001at23]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]
module.rbac_platform_app["e785218c-e5a5-4c8d-b1df-f262b8eaa241"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]
module.rbac_platform_app["143d9d84-6ef6-4c60-a2a5-9cb232dd2268"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 3s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at23/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at23]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + name                    = "db-psqlsrvaltinnauthregister001at23-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at23/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at23"
      + name                    = "db-psqlsrvaltinnauthregister001at23-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "9074584955188139715" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2025-02-20T13:23:32Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_at23-register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:AppConnectionString"
      + label                  = "at23-register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:AppConnectionString_at23_register"] will be destroyed
  # (because key ["Postgres:AppConnectionString_at23_register"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_vault_reference" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - content_type           = "application/vnd.microsoft.appconfig.keyvaultref+json;charset=utf-8" -> null
      - etag                   = "AaqewBCaR3nKpBYduiZdblYfeCPqDBM2s9NjJDMb0I0" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:AppConnectionString?label=at23_register" -> null
      - key                    = "Postgres:AppConnectionString" -> null
      - label                  = "at23_register" -> null
      - locked                 = false -> null
      - tags                   = {} -> null
      - type                   = "vault" -> null
      - value                  = jsonencode(
            {
              - uri = "https://kvregaltinnauth001at23.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at23-register-app"
            }
        ) -> null
      - vault_key_reference    = "https://kvregaltinnauth001at23.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at23-register-app" -> null
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_at23-register"] will be created
  + resource "azurerm_app_configuration_key" "key_vault_reference" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Postgres:MigrationConnectionString"
      + label                  = "at23-register"
      + locked                 = false
      + type                   = "vault"
      + vault_key_reference    = (known after apply)
    }

  # module.appsettings.azurerm_app_configuration_key.key_vault_reference["Postgres:MigrationConnectionString_at23_register"] will be destroyed
  # (because key ["Postgres:MigrationConnectionString_at23_register"] is not in for_each map)
  - resource "azurerm_app_configuration_key" "key_vault_reference" {
      - configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub" -> null
      - content_type           = "application/vnd.microsoft.appconfig.keyvaultref+json;charset=utf-8" -> null
      - etag                   = "EvpJbVtVIMMnzSwC_YRv7if62ZGsEq1ngPF8xlwYYPs" -> null
      - id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Postgres:MigrationConnectionString?label=at23_register" -> null
      - key                    = "Postgres:MigrationConnectionString" -> null
      - label                  = "at23_register" -> null
      - locked                 = false -> null
      - tags                   = {} -> null
      - type                   = "vault" -> null
      - value                  = jsonencode(
            {
              - uri = "https://kvregaltinnauth001at23.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at23-register-migrator"
            }
        ) -> null
      - vault_key_reference    = "https://kvregaltinnauth001at23.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at23-register-migrator" -> null
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at23/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at23_altinn.register.tfstate.tfplan`